jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
#include "usr_ble.h"

// Include utilities
#include "usr_util.h"

#include "usr_ble_settings.h"

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"

#if defined (UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined (UARTE_PRESENT)
#include "nrf_uarte.h"
#endif



#define NRF_LOG_MODULE_NAME usr_ble
#define NRF_LOG_LEVEL 4
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "nrf_delay.h"


#include "usr_gpio.h"

// TimeSync
#include "time_sync.h"
#include "nrf_gpiote.h"
#include "nrf_ppi.h"
#include "nrf_timer.h"

// Timers
#include "usr_tmr.h"

// IMU params
#include "imu_params.h"
#include "imu.h"
extern IMU imu;
extern imu_data_t imu_data;

// Application scheduler
#include "app_scheduler.h"

// Add TMS service for transmitting IMU data
#include "ble_tms.h"

// BLE Battery service
#include "ble_bas.h"

// BLE NUS Service
#include "usr_ble_nus.h"

// ADC
#include "usr_adc.h"



#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nrf_dfu_ble_svci_bond_sharing.h"
#include "nrf_svci_async_function.h"
#include "nrf_svci_async_handler.h"

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "app_timer.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "bsp_btn_ble.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_state.h"
#include "ble_dfu.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "fds.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_drv_clock.h"
#include "nrf_power.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_bootloader_info.h"


// Struct to keep track of TimeSync variables
typedef struct{
    uint32_t sync_interval_int_time; // How much time between measurements - (In increments of 2.5 ms)
    bool m_ts_synchronized;
    bool m_imu_trigger_enabled;
    bool m_ts_packet_received;
} time_sync_t;



time_sync_t ts = {
    .sync_interval_int_time = 4, // Default 100 Hz transmission rate
    .m_ts_synchronized = 0,
    .m_imu_trigger_enabled = 0,
    .m_ts_packet_received = 0,
};

ts_rf_config_t rf_config =
{
    .rf_chn = 80,
    .rf_addr = { 0xDE, 0xAD, 0xBE, 0xEF, 0x19 }
};


// Initialization
BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
ble_tms_t m_tms;                                                                    /**< Motion service */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
//static uint16_t   m_ble_nus_max_data_len = 247 - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */


static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE},
    {BLE_UUID_TMS_SERVICE, TMS_SERVICE_UUID_TYPE}, // Added for TMS service
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE}
};




void ble_send_quat(ble_tms_quat_t * data)
{
    ret_code_t err_code;

    err_code = ble_tms_quat_set(&m_tms, data);
    if(err_code != NRF_SUCCESS)
    {
        if(err_code == NRF_ERROR_RESOURCES)
        {
            NRF_LOG_INFO("Packet lost");
        }else{
            NRF_LOG_INFO("ble_tms_quat_set err_code: %d", err_code);
            APP_ERROR_CHECK(err_code);            
        }
    }
}

void ble_send_raw(ble_tms_raw_t * data)
{
    ret_code_t err_code;

    err_code = ble_tms_raw_set(&m_tms, data);	
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("ble_tms_raw_set err_code: %d", err_code);
        APP_ERROR_CHECK(err_code);
    }    
}

void ble_send_adc(ble_tms_adc_t * data)
{
    ret_code_t err_code;

    err_code = ble_tms_adc_set(&m_tms, data);
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("ble_tms_adc_set err_code: %d", err_code);
    } 
}

void ble_send_euler(ble_tms_euler_t * data)
{
    ret_code_t err_code;

    err_code = ble_tms_euler_set(&m_tms, data);
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_INFO("ble_tms_raw_set err_code: %d", err_code);
    }
}


// Print received config
static void print_config(ble_tms_config_t config)
{
    NRF_LOG_INFO("---RECEIVED CONFIG---")

    if(config.gyro_enabled) NRF_LOG_INFO("Gyro enabled");
    if(config.accel_enabled) NRF_LOG_INFO("Accel enabled");
    if(config.mag_enabled) NRF_LOG_INFO("Mag enabled");
    if(config.euler_enabled) NRF_LOG_INFO("Euler enabled");
    if(config.quat6_enabled) NRF_LOG_INFO("QUAT6 enabled");
    if(config.quat9_enabled) NRF_LOG_INFO("QUAT9 enabled");
    if(config.quat9_enabled) NRF_LOG_INFO("Calibration start enabled");
    NRF_LOG_INFO("Frequency: %d", config.motion_freq_hz);

    if(config.adc_enabled) NRF_LOG_INFO("ADC enabled");

    if(config.sync_enabled) NRF_LOG_INFO("SYNC enabled");
    NRF_LOG_INFO("Sync start time: %d", config.sync_start_time);

    if(config.wom_enabled) NRF_LOG_INFO("WoM enabled");
}



// Motion service event handler
static void ble_tms_evt_handler(ble_tms_t        * p_tms,
                                ble_tms_evt_type_t evt_type,
                                uint8_t          * p_data,
                                uint16_t           length)
{
    NRF_LOG_DEBUG("ble_tms_evt_handler called");
    ret_code_t err_code;
    
