jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
    switch (evt_type)
    {
        case BLE_TMS_EVT_NOTIF_TAP:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_TAP - %d\r\n", p_tms->is_tap_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_ADC:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ADC - %d\r\n", p_tms->is_adc_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_QUAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_QUAT - %d\r\n", p_tms->is_quat_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_PEDOMETER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_PEDOMETER - %d\r\n", p_tms->is_pedo_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_RAW:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_RAW - %d\r\n", p_tms->is_raw_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_EULER:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_EULER - %d\r\n", p_tms->is_euler_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_ROT_MAT:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_ROT_MAT - %d\r\n", p_tms->is_rot_mat_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_HEADING:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_HEADING - %d\r\n", p_tms->is_heading_notif_enabled);
            break;

        case BLE_TMS_EVT_NOTIF_GRAVITY:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_NOTIF_GRAVITY - %d\r\n", p_tms->is_gravity_notif_enabled);
            break;

        case BLE_TMS_EVT_CONFIG_RECEIVED:
            NRF_LOG_INFO("ble_tms_evt_handler: BLE_TMS_EVT_CONFIG_RECEIVED - %d\r\n", length);
            APP_ERROR_CHECK_BOOL(length == sizeof(ble_tms_config_t));

            // Init struct for storing received data
            ble_tms_config_t received_config;
            memcpy(&received_config, p_data, length);

            // Copy data into IMU struct
            imu.gyro_enabled = received_config.gyro_enabled;
            imu.accel_enabled = received_config.accel_enabled;
            imu.mag_enabled = received_config.mag_enabled;
            imu.quat6_enabled = received_config.quat6_enabled;
            imu.quat9_enabled = received_config.quat9_enabled;
            imu.euler_enabled = received_config.euler_enabled;
            if(received_config.motion_freq_hz != 0) imu.period = FREQ_TO_MS(received_config.motion_freq_hz); // Convert from frequency to period
            imu.sync = received_config.sync_enabled;
            imu.stop = received_config.stop;
            imu.adc = received_config.adc_enabled;
            imu.sync_start_time = received_config.sync_start_time;
            imu.wom = received_config.wom_enabled;
            imu.start_calibration = received_config.start_calibration;

            // If wake on motion command is received
            // - Break the BLE connection
            // - Turn of wake-on-motion
            // - Setup interrupt pin to wake-up microcontroller
            if (imu.wom)
            {
                NRF_LOG_INFO("in if(imu.wom) statement");
                ble_disconnect();
            }

            // Print out received config over RTT
            print_config(received_config);

            // Pass change IMU settings to event handler
            err_code = app_sched_event_put(0, 0, imu_config_evt_sceduled);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            break;
    }
}




void batt_level_update(uint8_t battery_level)
{
    ret_code_t err_code;

    err_code = ble_bas_battery_level_update(&m_bas, battery_level, BLE_CONN_HANDLE_ALL);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}




/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}



/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


static void ts_print_sync_time()
{
    uint64_t time_now_ticks;
    uint32_t time_now_msec;
    uint32_t time_ticks;

    time_now_ticks = ts_timestamp_get_ticks_u64();
    time_now_msec = TIME_SYNC_TIMESTAMP_TO_USEC(time_now_ticks) / 1000;
    time_ticks = TIME_SYNC_MSEC_TO_TICK(time_now_msec);
    NRF_LOG_INFO("Time: ticks %d - ms %d", time_ticks, time_now_msec);
}

static void ts_set_triggered_period(IMU imu)
{
    ts.sync_interval_int_time = (imu.period / TIME_SYNC_TIMER_PERIOD_MS);
}

static void ts_start_trigger(IMU imu)
{
    ret_code_t err_code;

    // Set timesync pin low
    nrf_gpio_pin_clear(TIMESYNC_PIN);

    // Print start time
    NRF_LOG_INFO("time.sync_start_time %d", imu.sync_start_time);

    if( ( imu.sync ) && ( imu.sync_start_time != 0) )
    {
        err_code = ts_set_trigger(imu.sync_start_time, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
        APP_ERROR_CHECK(err_code);
        ts.m_imu_trigger_enabled = 1 ;
    }else{
        ts.m_imu_trigger_enabled = 0;
    }
    NRF_LOG_INFO("ts.sync_interval_int_time: %d", ts.sync_interval_int_time);
}

// Event handler DIY
/**@brief GPIOTE sceduled handler, executed in main-context.
 */
void imu_config_evt_sceduled(void * p_event_data, uint16_t event_size)
{
		// Enable sensor parameters based on received configuration
		ret_code_t err_code;

        // Clear all buffers before starting a new measurement
        imu_clear_buff();

