jonacappelle/nRF52-BLE-IMU/BLE/usr_ble.c
        #if IMU_ENABLED == 1
		err_code =  imu_enable_sensors(imu);
		APP_ERROR_CHECK(err_code);
        #endif

        if( !imu.wom )
        {
            // Set correct trigger period for TS_EVT_TRIGGERED
            ts_set_triggered_period(imu);

            // Temp for debugging
            ts_print_sync_time();

            // Set trigger if peripheral is synced
            ts_start_trigger(imu);

            // TODO: ADC needs to be implemented
            // adc_enable(imu);
        }
}


void ble_disconnect(void)
{
    ret_code_t err_code;

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // NRF_LOG_INFO("m_conn_handle in sd_ble_gap_disconnect %d", m_conn_handle);
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        // NRF_LOG_INFO("m_conn_handle in sd_ble_gap_disconnect %d", m_conn_handle);
        APP_ERROR_CHECK(err_code);
    }
}


/**@snippet [Handling the data received over BLE] */
static void usr_qwr_init()
{
    uint32_t           err_code;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);
}


static void usr_tms_init(void)
{
    ret_code_t err_code;
    ble_tms_init_t        tms_init;

    // Initialize Motion service
    memset(&tms_init, 0, sizeof(tms_init));

    // Init with all parameters to default value
    tms_init.p_init_config->gyro_enabled = 0;
    tms_init.p_init_config->accel_enabled = 0;
    tms_init.p_init_config->mag_enabled = 0;
    tms_init.p_init_config->euler_enabled = 0;
    tms_init.p_init_config->quat6_enabled = 0;
    tms_init.p_init_config->quat9_enabled = 0;
    tms_init.p_init_config->wom_enabled = 1;
    tms_init.p_init_config->motion_freq_hz = 100;

    tms_init.evt_handler = ble_tms_evt_handler;

    err_code = ble_tms_init(&m_tms, &tms_init);
    APP_ERROR_CHECK(err_code);
}

static void usr_bas_init(void)
{
    ret_code_t err_code;
    ble_bas_init_t     bas_init;
    
    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    // Initialize Queued write module: for write requests (used by NUS + TMS)
    usr_qwr_init();

    // Initialize BLE NUS module
    usr_ble_nus_init();

    // Init TMS service
    usr_tms_init();

    // Initialize Battery service
    usr_bas_init();

    // Init DFU service
    // ble_dfu_init();
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
void sleep_mode_enter(void)
{
    ret_code_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    //Disable SoftDevice. It is required to be able to write to GPREGRET2 register (SoftDevice API blocks it).
    //GPREGRET2 register holds the information about skipping CRC check on next boot.
    err_code = nrf_sdh_disable_request();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            NRF_LOG_DEBUG("Fast Advertising");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;
        case BLE_ADV_EVT_IDLE:
            NRF_LOG_DEBUG("Advertising idle");

